---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModuleIterator.MoveNext
source: html/e4df3df8-f8df-dbe5-ef0b-00857e9cd6ee.htm
---
# Autodesk.Revit.DB.Macros.MacroModuleIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.